<template>
  <div>
    <h1>О КОМПАНИИ</h1>
    <p>Разместите на этой странице информацию с описанием вашего магазина.</p>
    <p>Например:</p>
    <h3>Интернет-магазин "MyShop.ru" – лучшие товары по низким ценам!</h3>
    <p>
      Мы рады предложить вам недорогие, но качественные товары с подробными описаниями, характеристиками 
      и фотографиями. У нас Вы можете купить замечательные товары: технику, электронику, одежду, обувь, 
      игрушки, книги и многое другое в вашем регионе по ценам производителей и без наценки. 
      Продажа большого ассортимента разнообразных товаров – основная специализация нашего интернет-магазина. 
      Мы доставим ваш заказ бесплатно в любой уголок мира, осуществим подробную консультацию по товарам и 
      поможем с выбором. Магазин "MyShop.ru" предлагает Вам купить качественную и доступную технику, 
      электронику, одежду, обувь, игрушки, книги и многое другое с доставкой! Все виды современных товаров 
      от эконом класса до более дорогих представлены в нашем каталоге. Вы можете купить любые товары в 
      вашем городе: технику, электронику, одежду, обувь, игрушки, книги и многое другое.
      </p>
    <ul>
      <h3>Наши главные преимущества:</h3>
      <li>Низкие цены от производителей</li>
      <li>Доставка по городу в день заказа</li>
      <li>Доставка заказов Почтой по всей Стране за 5-15 дней</li>
      <li>Только оригинальная и сертифицированная продукция</li>
      <li>Гарантия на все товары – 5 лет!</li>
      <li>Не понравился товар? Вернем или обменяем в течение 14-ти дней без оформления лишних бумаг!</li>
      <li>Бонусы и скидки для постоянных покупателей</li>
    </ul>
    <p>Эту страницу можно отредактировать в бэк-офисе сайта в разделе Меню и страницы.
      Подробнее о создании текстовых страниц и меню, читайте в документации: 
      https://www.insales.ru/collection/doc-settings/product/razdel-menyu</p>
  </div>
</template>

<script>


export default {
  data() {
    return {
      showModal: true,
    }
  },
  components: {
  }
}
</script>
