<template>
  <div class="about">
    <h1 class="center">This is an delivery page</h1>
    <h2 class="del">ДОСТАВКА</h2>
    <p>
      Разместите на этой странице информацию с описанием способов 
      доставки, которые использует ваш интернет-магазин.
    </p>
    <p>
      Например:
    </p>
    <p>
      Наш интернет-магазин осуществляет доставку по Москве и регионам России:
    </p>
    <ol>
      <li>Курьерская доставка по Москве — 200 руб. </li>
      <li>Самовывоз из нашего пункта выдачи или розничного магазина – бесплатно!</li>
      <li>Почтовая доставка по России — от 150 руб. в зависимости от адреса доставки.</li>
    </ol>
    <p>
      Сроки доставки:
    </p>
    <ol>
      <li>Курьерская доставка по Москве – на следующий день</li>
      <li>Самовывоз – на следующий день</li>
      <li>Почтовая доставка по России – от 3 до 14 дней в зависимости от региона</li>
    </ol>
    <p>Доставка осуществляется бесплатно при сумме заказа более 7000 рублей.</p>
    <p>----</p>
    <p>Эту страницу можно отредактировать в бэк-офисе сайта в разделе Меню и страницы.</p>
    <p>Подробнее о создании текстовых страниц и меню, читайте в документации: <a href=""></a></p>
    <p>Настроить расчёт стоимости доставки при оформлении заказа можно настроить в разделе <a href=""></a></p>
    <p>Подробнее о настройке способов доставки, читайте в документации: <a href=""></a></p>
  </div>
</template>
