<template>
  <div>
    <h1 class="center">Редактор текста</h1>
    <div v-html="contacts">

    </div>
    <div class="wrapper">
      <Tiptap
      :modelValue="contacts"
      @newContent="showNewContent"
      @update="changeValue"
      />
    </div>
  </div>
</template>

<script>
import Tiptap from '@/components/Admin/Tiptap'

export default {
  data() {
    return {
      contacts: `
        <p>ДОСТАВКА
          Разместите на этой странице информацию с описанием способов доставки, которые использует ваш интернет-магазин.

          Например:

          Наш интернет-магазин осуществляет доставку по Москве и регионам России:

          Курьерская доставка по Москве — 200 руб.
          Самовывоз из нашего пункта выдачи или розничного магазина – бесплатно!
          Почтовая доставка по России — от 150 руб. в зависимости от адреса доставки.
          Сроки доставки:

          Курьерская доставка по Москве – на следующий день
          Самовывоз – на следующий день
          Почтовая доставка по России – от 3 до 14 дней в зависимости от региона
          Доставка осуществляется бесплатно при сумме заказа более 7000 рублей.

          ----

          Эту страницу можно отредактировать в бэк-офисе сайта в разделе Меню и страницы.

          Подробнее о создании текстовых страниц и меню, читайте в документации:

          Настроить расчёт стоимости доставки при оформлении заказа можно настроить в разделе

          Подробнее о настройке способов доставки, читайте в документации:
        </p>
      `
    }
  },
  methods: {
    showNewContent(content) {
      console.log(content, 'content');
    },
    changeValue(value) {
      console.log('есть изменения');
      this.contacts = value
    }
  },
  components: {
    Tiptap,
  }
}
</script>
<style lang="scss">
.wrapper {
  padding: 20px;
  margin: 10px;
  border-bottom: 1xp solid black;
}
</style>

